rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
SELECT "movies".* FROM "movies"
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_same_director
    @movie = Movie.find(params[:id]) # look up movie by unique ID
    #@movies = Movie.find_by_director(@movie.director)
    @movies = Movie.where(director: @movie.director)
    if @movie.director.empty?

UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["updated_at", "2015-11-20 15:44:13.439828"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)